[
  {
    "tag": "Frog Race Fallout",
    "headline": "Professors at the Frog Race – Coincidence or a Snitch?",
    "body": "What was supposed to be a lighthearted frog race turned suspicious when half the faculty showed up unannounced. Rumors suggest someone tipped them off—jealous rival, teacher’s pet, or a saboteur with a grudge against illegal betting rings.",
    "quote": "We don't attend frog races for fun—we attend when rules are broken. A first-year student informed the professor."
  },
  {
    "tag": "Romantic Entanglements",
    "headline": "Aragon's Eyes Tell All",
    "body": "Students report Aragon has been staring at his crushes far too intently. Not the dreamy kind of gaze—the unsettling kind that makes you wonder if a love spell is brewing. Subtlety is clearly not his strongest charm."
  },
  {
    "tag": "Exam Season Drama",
    "headline": "Katrina's Exam Struggles and a Missing Admirer",
    "body": "Katrina continues to battle her spell exams, but the real shock is the absence of Aragon’s usual fawning. Has his attention shifted to a new girl, a guy, a vampire—or even a frog? The halls hum with speculation."
  },
  {
    "tag": "Popularity Wars",
    "headline": "Rowan's Rise to Fame",
    "body": "Rowan seems to be basking in Aragon’s former spotlight. Whispers suggest the 'hots' are shifting, and a rivalry may be brewing. Is this the start of a magical popularity war, or just the natural evolution of campus crushes?"
  },
  {
    "tag": "Magical Mishaps",
    "headline": "Aragon's MTD Disaster",
    "body": "Thanks to his Magical Transmitted Devices (MTDs), Aragon missed his exam and failed to level up with his peers. Was this a convenient excuse to dodge the test, or did the devices truly betray him at the worst possible moment?"
  },
  {
    "tag": "Schemes & Shenanigans",
    "headline": "Percy’s Paper Chase",
    "body": "Percy was spotted near the faculty lounge with a cloak of invisibility that only works on Tuesdays. Coincidentally, Tyson has started appearing in classes he’s not enrolled in, right when exam papers are being handed out. No one is saying it’s a heist—but everyone is thinking it.",
    "quote": "Honestly, if these students put half as much effort into studying as they do into scheming, we'd have a dozen new theorems by now."
  }
]
