[
  {
    "id": "sept-2025",
    "month": "September 2025",
    "volume": "Vol. 01",
    "title": "Water Dancing: The Sport That Heals?",
    "lede": "In a campus where equations ripple through reality, Water Dancing has emerged as both spectacle and potential therapy.",
    "sections": [
      {
        "heading": "Healing Phenomenon",
        "body": "Students report unexpected physical and emotional healing after Water Dancing sessions. Third-year Kaelin Thorne notes stabilized energy and smoother spellcasting after just two weeks of practice."
      },
      {
        "heading": "The Hydroharmonic Effect",
        "body": "Professor Zivan Moru and the Quandrix Research Guild investigate whether fractal dance patterns—Fibonacci spirals, Möbius loops, and more—interact with the body's mana lattice to produce measurable healing."
      },
      {
        "heading": "Leylines and Lakes",
        "body": "The Water Dancing lake is fed by a subterranean spring intersecting a leyline node. Researchers debate whether the water itself is imbued with restorative properties or if the effect is purely mathematical resonance."
      }
    ],
    "rumors": [
      "Some students claim their nightmares stopped after a midnight Water Dancing session.",
      "A few professors quietly attend practices under illusion spells."
    ],
    "highlights": [
      "Aragon is still struggling to survive on campus, gets stuck in Edgemoor.",
      "Aragon celebrates his birthday in a chokehold with Quandrix slugs and bats.",
      "Rowan edges closer to discovering the truth connecting life and death.",
      "No sign of Katrina this week—lost in the woods or with an old lover?",
      "A new student joins mid-semester; whispers of gold changing hands circulate.",
      "JJ Jameson recruits a new junior editor, raising hopes for the future of the Strixhaven Star."
    ]
  },
  {
    "id": "oct-2025",
    "month": "October 2025",
    "volume": "Vol. 02",
    "title": "Heroic Inspiration: Fueling the Fire of Greatness",
    "lede": "As exam season descends like a fog of stress and caffeine, Quandrix turns its gaze to the nature of Heroic Inspiration.",
    "sections": [
      {
        "heading": "What Is Heroic Inspiration?",
        "body": "More than a simple reroll, Heroic Inspiration is framed as a magical boon for students who demonstrate courage, creativity, and brilliance in the face of adversity."
      },
      {
        "heading": "Faculty Perspectives",
        "body": "Professor Taniz Merith calls inspiration 'the quantum leap of the soul.' Professor Zimone Wola insists it must be 'derived, like any good theorem, through action.' Dean Tullus awards it when students turn chaos into clarity."
      }
    ],
    "rumors": [
      "Some students suspect Heroic Inspiration can be 'gamed' with dramatic monologues.",
      "A secret rubric for awarding Inspiration may be hidden in the Arithmancy department."
    ],
    "highlights": [
      "Aragon's alchemical gains raise eyebrows as his potions start smelling like vanilla protein shakes.",
      "Katrina's amphibious crisis continues as her frog familiar vanishes into the woods.",
      "Percy is spotted near the faculty lounge with a Tuesday-only invisibility cloak.",
      "Tyson mysteriously appears in classes he’s not enrolled in, right when exam papers are handed out.",
      "Professor Vemra laments that if students schemed less and studied more, Quandrix would have a dozen new theorems."
    ]
  },
  {
    "id": "nov-2025",
    "month": "November 2025",
    "volume": "Vol. 03",
    "title": "The Doctrine of Division: Unearthing the Dark Alchemy of N.K. Michaels (Part 1)",
    "lede": "An unmarked vial discovered near the abandoned alchemy wing sends ripples of fear through Quandrix College.",
    "sections": [
      {
        "heading": "The Discovery",
        "body": "Spellcraft apprentices find a shimmering, iridescent liquid that shifts from emerald to deep violet under moonlight. The vial bears faint runes and emits a palpable heaviness in the air."
      },
      {
        "heading": "Campus Security Warning",
        "body": "Security urges students not to touch, taste, or neutralize the substance. The area is cordoned off, but rumors of additional vials and vanishing footprints into the forest persist."
      },
      {
        "heading": "The Shadow of N.K. Michaels",
        "body": "Once expelled for 'social alchemy'—potions that manipulate trust and loyalty—Michaels' work was banned and erased from official archives. The runes on the vial match those described in his final manuscript, The Doctrine of Division."
      },
      {
        "heading": "A Magical Creature Speaks",
        "body": "Thyriel, a centaur elder, describes the vial as a weapon that seeks to divide and poison trust. Pixies avoid the alchemy wing, and even the owls have fallen eerily silent."
      }
    ],
    "rumors": [
      "Some students whisper that 'one drop could silence a species forever.'",
      "Others claim Michaels' ideology is being revived by a secret campus faction."
    ],
    "highlights": [
      "Faculty presence at the frog race sparks speculation about a mysterious tip-off.",
      "Aragon's intense staring habits raise questions about possible love spells.",
      "Katrina struggles with exams while her usual admirer is conspicuously absent.",
      "Rowan’s rising popularity hints at a brewing rivalry.",
      "Aragon misses an exam due to Magical Transmitted Devices, stalling his level-up."
    ]
  }
]
