[
  {
    "title": "Water Dancing: The Sport That Heals?",
    "arc": "Hydroharmonic Effect",
    "date": "September 2025",
    "summary": "Water Dancing at the Quandrix lakeside arenas reveals unexpected healing effects among students.",
    "details": "Introduced by Professor Zivan Moru, Water Dancing blends motion, magic, and fluid dynamics. Students like Kaelin Thorne report improved energy and smoother spellcasting after sessions. The Quandrix Research Guild investigates the so-called Hydroharmonic Effect, exploring whether Fibonacci spirals, Möbius loops, and a leyline-fed lake are responsible for the restorative properties."
  },
  {
    "title": "Heroic Inspiration: Fueling the Fire of Greatness",
    "arc": "Inspiration & Exams",
    "date": "October 2025",
    "summary": "Quandrix faculty formalize Heroic Inspiration as a magical boon for brilliance, courage, and chaos.",
    "details": "In the pressure-cooker of exam season, professors like Taniz Merith, Zimone Wola, and Dean Tullus define Heroic Inspiration as a reward for turning chaos into clarity. Mechanically, it grants rerolls on failed checks, but in practice it celebrates students who embody academic excellence, creative problem-solving, and occasionally, sheer audacity."
  },
  {
    "title": "The Doctrine of Division: Racism Liquid",
    "arc": "N.K. Michaels & Social Alchemy",
    "date": "November 2025",
    "summary": "An unmarked iridescent vial is discovered near the abandoned alchemy wing, echoing the banned work of N.K. Michaels.",
    "details": "A group of spellcraft apprentices find a shimmering liquid that shifts from emerald to violet under moonlight. The vial bears faint runes matching those in Michaels' forbidden manuscript, The Doctrine of Division. Thyriel the centaur elder warns that the substance feels like a weapon designed to divide and poison trust among magical species. Security cordons off the area, but rumors of more vials and vanishing footprints into the forest persist."
  }
]
